relatorio_html/statistics.json
{
  "Delete Patient" : {
    "transaction" : "Delete Patient",
    "sampleCount" : 200000,
    "errorCount" : 356,
    "errorPct" : 0.178,
    "meanResTime" : 479.7433800000089,
    "medianResTime" : 312.0,
    "minResTime" : 3.0,
    "maxResTime" : 4080.0,
    "pct1ResTime" : 469.90000000000146,
    "pct2ResTime" : 557.0,
    "pct3ResTime" : 1966.9600000000064,
    "throughput" : 70.45669678573026,
    "receivedKBytesPerSec" : 24.409711248530538,
    "sentKBytesPerSec" : 13.566645790384104
  },
  "Update Patient" : {
    "transaction" : "Update Patient",
    "sampleCount" : 200000,
    "errorCount" : 394,
    "errorPct" : 0.197,
    "meanResTime" : 540.9480300000091,
    "medianResTime" : 370.0,
    "minResTime" : 4.0,
    "maxResTime" : 4128.0,
    "pct1ResTime" : 555.0,
    "pct2ResTime" : 656.9500000000007,
    "pct3ResTime" : 2216.0,
    "throughput" : 70.45637411771006,
    "receivedKBytesPerSec" : 24.432818757406725,
    "sentKBytesPerSec" : 26.578146544238148
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 1000000,
    "errorCount" : 1490,
    "errorPct" : 0.149,
    "meanResTime" : 493.9444090000141,
    "medianResTime" : 153.0,
    "minResTime" : 2.0,
    "maxResTime" : 4128.0,
    "pct1ResTime" : 305.0,
    "pct2ResTime" : 381.0,
    "pct3ResTime" : 1487.9700000000048,
    "throughput" : 352.27144628564986,
    "receivedKBytesPerSec" : 2836.957448306367,
    "sentKBytesPerSec" : 87.48343223354189
  },
  "List Patients" : {
    "transaction" : "List Patients",
    "sampleCount" : 200000,
    "errorCount" : 192,
    "errorPct" : 0.096,
    "meanResTime" : 472.47778000000346,
    "medianResTime" : 308.0,
    "minResTime" : 2.0,
    "maxResTime" : 3938.0,
    "pct1ResTime" : 463.0,
    "pct2ResTime" : 546.9500000000007,
    "pct3ResTime" : 1792.9600000000064,
    "throughput" : 70.45679606879261,
    "receivedKBytesPerSec" : 2739.9975933774926,
    "sentKBytesPerSec" : 10.58586939635083
  },
  "Read Patient" : {
    "transaction" : "Read Patient",
    "sampleCount" : 200000,
    "errorCount" : 362,
    "errorPct" : 0.181,
    "meanResTime" : 453.0979799999935,
    "medianResTime" : 287.0,
    "minResTime" : 2.0,
    "maxResTime" : 3888.0,
    "pct1ResTime" : 432.0,
    "pct2ResTime" : 517.0,
    "pct3ResTime" : 1872.9600000000064,
    "throughput" : 70.45612591355174,
    "receivedKBytesPerSec" : 23.932220004163074,
    "sentKBytesPerSec" : 12.053822202447046
  },
  "Create Patient" : {
    "transaction" : "Create Patient",
    "sampleCount" : 200000,
    "errorCount" : 186,
    "errorPct" : 0.093,
    "meanResTime" : 523.4548750000032,
    "medianResTime" : 355.0,
    "minResTime" : 4.0,
    "maxResTime" : 4059.0,
    "pct1ResTime" : 529.0,
    "pct2ResTime" : 622.0,
    "pct3ResTime" : 2170.0,
    "throughput" : 70.4550586555977,
    "receivedKBytesPerSec" : 24.28503857766737,
    "sentKBytesPerSec" : 24.701158951588216
  }
}